АТДЛК/src/Documents/АктВыполненныхРабот/АктВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВыполненныхРабот</name>
  <basedOn>Document.ЗаявкаНаПеревозку</basedOn>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/Documents/АктВыполненныхРабот/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаполнитьДанныеПеревозчикаНаСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПеревозчикаНаСервер();
	Объект.Перевозчик = Объект.Заявка.Перевозчик;
	Объект.Сумма = Объект.Заявка.Сумма;
КонецПроцедуры
